#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Acquiring state lock. This may take a few moments...
module.fivetran_db.random_password.app_user[0]: Refreshing state... [id=none]
module.employees.random_password.users["gilfoyle"]: Refreshing state... [id=none]
module.meltano_db.random_password.app_user[0]: Refreshing state... [id=none]
module.employees.random_password.users["richard"]: Refreshing state... [id=none]
module.stitch_db.random_password.app_user[0]: Refreshing state... [id=none]
module.bulk_roles.snowflake_role.main["ANALYST"]: Refreshing state... [id=ANALYST]
module.stitch_db.snowflake_warehouse.app[0]: Refreshing state... [id=STITCH_WH]
module.fivetran_db.snowflake_database.app: Refreshing state... [id=FIVETRAN]
module.bulk_roles.snowflake_role.main["READER"]: Refreshing state... [id=READER]
module.analytics_db["STAGING"].snowflake_database.app: Refreshing state... [id=ANALYTICS_STAGING]
module.bulk_roles.snowflake_role.main["DBT_CLOUD"]: Refreshing state... [id=DBT_CLOUD]
module.stitch_db.snowflake_database.app: Refreshing state... [id=STITCH]
module.analytics_db["PROD"].snowflake_database.app: Refreshing state... [id=ANALYTICS_PROD]
module.bulk_warehouses.snowflake_warehouse.main["REPORTING_WH"]: Refreshing state... [id=REPORTING_WH]
module.fivetran_db.snowflake_warehouse.app[0]: Refreshing state... [id=FIVETRAN_WH]
module.meltano_db.snowflake_warehouse.app[0]: Refreshing state... [id=MELTANO_WH]
module.bulk_warehouses.snowflake_warehouse.main["PROCESSING_WH"]: Refreshing state... [id=PROCESSING_WH]
module.employees.snowflake_user.main["richard"]: Refreshing state... [id=Richard Hendricks]
module.meltano_db.snowflake_database.app: Refreshing state... [id=MELTANO]
module.employees.snowflake_user.main["gilfoyle"]: Refreshing state... [id=gilfoyle]
module.stitch_db.snowflake_role.admin: Refreshing state... [id=STITCH_ADMIN]
module.stitch_db.snowflake_role.reader: Refreshing state... [id=STITCH_READER]
module.fivetran_db.snowflake_role.reader: Refreshing state... [id=FIVETRAN_READER]
module.fivetran_db.snowflake_role.admin: Refreshing state... [id=FIVETRAN_ADMIN]
module.systems.random_password.users["SUPERSET_USER"]: Refreshing state... [id=none]
module.systems.random_password.users["DBT_CLOUD_USER"]: Refreshing state... [id=none]
module.systems.random_password.users["HIGHTOUCH_USER"]: Refreshing state... [id=none]
module.systems.random_password.users["IMMUTA_USER"]: Refreshing state... [id=none]
module.systems.random_password.users["LOOKER_USER"]: Refreshing state... [id=none]
module.systems.snowflake_user.main["LOOKER_USER"]: Refreshing state... [id=LOOKER_USER]
module.systems.snowflake_user.main["SUPERSET_USER"]: Refreshing state... [id=SUPERSET_USER]
module.systems.snowflake_user.main["DBT_CLOUD_USER"]: Refreshing state... [id=DBT_CLOUD_USER]
module.systems.snowflake_user.main["HIGHTOUCH_USER"]: Refreshing state... [id=HIGHTOUCH_USER]
module.systems.snowflake_user.main["IMMUTA_USER"]: Refreshing state... [id=IMMUTA_USER]
module.analytics_db["STAGING"].snowflake_role.reader: Refreshing state... [id=ANALYTICS_STAGING_READER]
module.analytics_db["PROD"].snowflake_role.reader: Refreshing state... [id=ANALYTICS_PROD_READER]
module.analytics_db["STAGING"].snowflake_role.admin: Refreshing state... [id=ANALYTICS_STAGING_ADMIN]
module.analytics_db["PROD"].snowflake_role.admin: Refreshing state... [id=ANALYTICS_PROD_ADMIN]
module.stitch_db.snowflake_warehouse_grant.app_role[0]: Refreshing state... [id=STITCH_WH|USAGE|false|STITCH_ADMIN]
module.stitch_db.snowflake_user.app[0]: Refreshing state... [id=STITCH_USER]
module.fivetran_db.snowflake_user.app[0]: Refreshing state... [id=FIVETRAN_USER]
module.stitch_db.snowflake_role_grants.reader[0]: Refreshing state... [id=STITCH_READER|READER|]
module.fivetran_db.snowflake_warehouse_grant.app_role[0]: Refreshing state... [id=FIVETRAN_WH|USAGE|false|FIVETRAN_ADMIN]
module.fivetran_db.snowflake_role_grants.reader[0]: Refreshing state... [id=FIVETRAN_READER|READER|]
module.bulk_role_grants.snowflake_role_grants.main["READER"]: Refreshing state... [id=READER|ANALYST|Richard Hendricks]
module.stitch_db.snowflake_pipe_grant.admin["OPERATE"]: Refreshing state... [id=STITCH|PUBLIC||OPERATE|false|true|STITCH_ADMIN]
module.stitch_db.snowflake_table_grant.admin["INSERT"]: Refreshing state... [id=STITCH|||INSERT|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_table_grant.admin["DELETE"]: Refreshing state... [id=STITCH|||DELETE|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_table_grant.admin["TRUNCATE"]: Refreshing state... [id=STITCH|||TRUNCATE|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_table_grant.admin["UPDATE"]: Refreshing state... [id=STITCH|||UPDATE|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.public_admin["CREATE PIPE"]: Refreshing state... [id=STITCH|PUBLIC|CREATE PIPE|false|false|false|STITCH_ADMIN|]
module.stitch_db.snowflake_database_grant.admin["CREATE SCHEMA"]: Refreshing state... [id=STITCH|CREATE SCHEMA|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.public_admin["CREATE FUNCTION"]: Refreshing state... [id=STITCH|PUBLIC|CREATE FUNCTION|false|false|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.public_admin["CREATE FILE FORMAT"]: Refreshing state... [id=STITCH|PUBLIC|CREATE FILE FORMAT|false|false|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.public_admin["MONITOR"]: Refreshing state... [id=STITCH|PUBLIC|MONITOR|false|false|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.public_admin["CREATE STAGE"]: Refreshing state... [id=STITCH|PUBLIC|CREATE STAGE|false|false|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.public_admin["CREATE PROCEDURE"]: Refreshing state... [id=STITCH|PUBLIC|CREATE PROCEDURE|false|false|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.public_admin["MODIFY"]: Refreshing state... [id=STITCH|PUBLIC|MODIFY|false|false|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.public_admin["CREATE SEQUENCE"]: Refreshing state... [id=STITCH|PUBLIC|CREATE SEQUENCE|false|false|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.public_admin["CREATE MASKING POLICY"]: Refreshing state... [id=STITCH|PUBLIC|CREATE MASKING POLICY|false|false|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.public_admin["CREATE STREAM"]: Refreshing state... [id=STITCH|PUBLIC|CREATE STREAM|false|false|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.public_admin["CREATE TASK"]: Refreshing state... [id=STITCH|PUBLIC|CREATE TASK|false|false|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.public_admin["CREATE TABLE"]: Refreshing state... [id=STITCH|PUBLIC|CREATE TABLE|false|false|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.public_admin["CREATE VIEW"]: Refreshing state... [id=STITCH|PUBLIC|CREATE VIEW|false|false|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.public_admin["CREATE EXTERNAL TABLE"]: Refreshing state... [id=STITCH|PUBLIC|CREATE EXTERNAL TABLE|false|false|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.admin["CREATE EXTERNAL TABLE"]: Refreshing state... [id=STITCH||CREATE EXTERNAL TABLE|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.admin["MONITOR"]: Refreshing state... [id=STITCH||MONITOR|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.admin["CREATE PIPE"]: Refreshing state... [id=STITCH||CREATE PIPE|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.admin["CREATE FILE FORMAT"]: Refreshing state... [id=STITCH||CREATE FILE FORMAT|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.admin["CREATE SEQUENCE"]: Refreshing state... [id=STITCH||CREATE SEQUENCE|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.admin["CREATE VIEW"]: Refreshing state... [id=STITCH||CREATE VIEW|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.admin["CREATE TASK"]: Refreshing state... [id=STITCH||CREATE TASK|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.admin["CREATE PROCEDURE"]: Refreshing state... [id=STITCH||CREATE PROCEDURE|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.admin["MODIFY"]: Refreshing state... [id=STITCH||MODIFY|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.admin["CREATE FUNCTION"]: Refreshing state... [id=STITCH||CREATE FUNCTION|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.admin["CREATE MASKING POLICY"]: Refreshing state... [id=STITCH||CREATE MASKING POLICY|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.admin["CREATE STREAM"]: Refreshing state... [id=STITCH||CREATE STREAM|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.admin["CREATE TABLE"]: Refreshing state... [id=STITCH||CREATE TABLE|false|true|false|STITCH_ADMIN|]
module.stitch_db.snowflake_schema_grant.admin["CREATE STAGE"]: Refreshing state... [id=STITCH||CREATE STAGE|false|true|false|STITCH_ADMIN|]
module.fivetran_db.snowflake_table_grant.admin["UPDATE"]: Refreshing state... [id=FIVETRAN|||UPDATE|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_table_grant.admin["DELETE"]: Refreshing state... [id=FIVETRAN|||DELETE|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_table_grant.admin["INSERT"]: Refreshing state... [id=FIVETRAN|||INSERT|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_table_grant.admin["TRUNCATE"]: Refreshing state... [id=FIVETRAN|||TRUNCATE|false|true|false|FIVETRAN_ADMIN|]
module.stitch_db.snowflake_view_grant.read["REFERENCES"]: Refreshing state... [id=STITCH|||REFERENCES|false|true|false|STITCH_READER,STITCH_ADMIN|]
module.stitch_db.snowflake_view_grant.read["SELECT"]: Refreshing state... [id=STITCH|||SELECT|false|true|false|STITCH_READER,STITCH_ADMIN|]
module.fivetran_db.snowflake_schema_grant.admin["CREATE TABLE"]: Refreshing state... [id=FIVETRAN||CREATE TABLE|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.admin["CREATE PIPE"]: Refreshing state... [id=FIVETRAN||CREATE PIPE|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.admin["MODIFY"]: Refreshing state... [id=FIVETRAN||MODIFY|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.admin["CREATE FUNCTION"]: Refreshing state... [id=FIVETRAN||CREATE FUNCTION|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.admin["CREATE STREAM"]: Refreshing state... [id=FIVETRAN||CREATE STREAM|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.admin["CREATE PROCEDURE"]: Refreshing state... [id=FIVETRAN||CREATE PROCEDURE|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.admin["CREATE MASKING POLICY"]: Refreshing state... [id=FIVETRAN||CREATE MASKING POLICY|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.admin["CREATE EXTERNAL TABLE"]: Refreshing state... [id=FIVETRAN||CREATE EXTERNAL TABLE|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.admin["CREATE TASK"]: Refreshing state... [id=FIVETRAN||CREATE TASK|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.admin["CREATE VIEW"]: Refreshing state... [id=FIVETRAN||CREATE VIEW|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.admin["CREATE SEQUENCE"]: Refreshing state... [id=FIVETRAN||CREATE SEQUENCE|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.admin["CREATE STAGE"]: Refreshing state... [id=FIVETRAN||CREATE STAGE|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_database_grant.admin["CREATE SCHEMA"]: Refreshing state... [id=FIVETRAN|CREATE SCHEMA|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.admin["CREATE FILE FORMAT"]: Refreshing state... [id=FIVETRAN||CREATE FILE FORMAT|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.admin["MONITOR"]: Refreshing state... [id=FIVETRAN||MONITOR|false|true|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_pipe_grant.admin["OPERATE"]: Refreshing state... [id=FIVETRAN|PUBLIC||OPERATE|false|true|FIVETRAN_ADMIN]
module.stitch_db.snowflake_stage_grant.read["USAGE"]: Refreshing state... [id=STITCH|PUBLIC||USAGE|false|true|false|STITCH_READER,STITCH_ADMIN]
module.fivetran_db.snowflake_schema_grant.public_admin["CREATE EXTERNAL TABLE"]: Refreshing state... [id=FIVETRAN|PUBLIC|CREATE EXTERNAL TABLE|false|false|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.public_admin["CREATE FILE FORMAT"]: Refreshing state... [id=FIVETRAN|PUBLIC|CREATE FILE FORMAT|false|false|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.public_admin["CREATE MASKING POLICY"]: Refreshing state... [id=FIVETRAN|PUBLIC|CREATE MASKING POLICY|false|false|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.public_admin["CREATE STREAM"]: Refreshing state... [id=FIVETRAN|PUBLIC|CREATE STREAM|false|false|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.public_admin["CREATE PROCEDURE"]: Refreshing state... [id=FIVETRAN|PUBLIC|CREATE PROCEDURE|false|false|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.public_admin["CREATE SEQUENCE"]: Refreshing state... [id=FIVETRAN|PUBLIC|CREATE SEQUENCE|false|false|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.public_admin["CREATE TASK"]: Refreshing state... [id=FIVETRAN|PUBLIC|CREATE TASK|false|false|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.public_admin["CREATE TABLE"]: Refreshing state... [id=FIVETRAN|PUBLIC|CREATE TABLE|false|false|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.public_admin["MODIFY"]: Refreshing state... [id=FIVETRAN|PUBLIC|MODIFY|false|false|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.public_admin["CREATE FUNCTION"]: Refreshing state... [id=FIVETRAN|PUBLIC|CREATE FUNCTION|false|false|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.public_admin["CREATE STAGE"]: Refreshing state... [id=FIVETRAN|PUBLIC|CREATE STAGE|false|false|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.public_admin["MONITOR"]: Refreshing state... [id=FIVETRAN|PUBLIC|MONITOR|false|false|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.public_admin["CREATE VIEW"]: Refreshing state... [id=FIVETRAN|PUBLIC|CREATE VIEW|false|false|false|FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.public_admin["CREATE PIPE"]: Refreshing state... [id=FIVETRAN|PUBLIC|CREATE PIPE|false|false|false|FIVETRAN_ADMIN|]
module.stitch_db.snowflake_stream_grant.read["SELECT"]: Refreshing state... [id=STITCH|PUBLIC||SELECT|false|true|false|STITCH_READER,STITCH_ADMIN]
module.stitch_db.snowflake_schema_grant.read["USAGE"]: Refreshing state... [id=STITCH||USAGE|false|true|false|STITCH_READER,STITCH_ADMIN|]
module.stitch_db.snowflake_database_grant.read["USAGE"]: Refreshing state... [id=STITCH|USAGE|false|STITCH_READER,STITCH_ADMIN|]
module.stitch_db.snowflake_pipe_grant.read["MONITOR"]: Refreshing state... [id=STITCH|PUBLIC||MONITOR|false|true|STITCH_READER,STITCH_ADMIN]
module.stitch_db.snowflake_table_grant.read["SELECT"]: Refreshing state... [id=STITCH|||SELECT|false|true|false|STITCH_READER,STITCH_ADMIN|]
module.stitch_db.snowflake_table_grant.read["REFERENCES"]: Refreshing state... [id=STITCH|||REFERENCES|false|true|false|STITCH_READER,STITCH_ADMIN|]
module.stitch_db.snowflake_external_table_grant.read["SELECT"]: Refreshing state... [id=STITCH|PUBLIC||SELECT|false|true|false|STITCH_READER,STITCH_ADMIN|]
module.stitch_db.snowflake_sequence_grant.read["USAGE"]: Refreshing state... [id=STITCH|PUBLIC||USAGE|false|true|false|STITCH_READER,STITCH_ADMIN]
module.stitch_db.snowflake_file_format_grant.read["USAGE"]: Refreshing state... [id=STITCH|PUBLIC||USAGE|false|true|false|STITCH_READER,STITCH_ADMIN]
module.stitch_db.snowflake_schema_grant.public_read["USAGE"]: Refreshing state... [id=STITCH|PUBLIC|USAGE|false|false|false|STITCH_READER,STITCH_ADMIN|]
module.stitch_db.snowflake_procedure_grant.read["USAGE"]: Refreshing state... [id=STITCH|PUBLIC|||USAGE|false|true|false|STITCH_READER,STITCH_ADMIN|]
module.meltano_db.snowflake_role.admin: Refreshing state... [id=MELTANO_ADMIN]
module.meltano_db.snowflake_role.reader: Refreshing state... [id=MELTANO_READER]
module.fivetran_db.snowflake_sequence_grant.read["USAGE"]: Refreshing state... [id=FIVETRAN|PUBLIC||USAGE|false|true|false|FIVETRAN_READER,FIVETRAN_ADMIN]
module.fivetran_db.snowflake_procedure_grant.read["USAGE"]: Refreshing state... [id=FIVETRAN|PUBLIC|||USAGE|false|true|false|FIVETRAN_READER,FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_database_grant.read["USAGE"]: Refreshing state... [id=FIVETRAN|USAGE|false|FIVETRAN_READER,FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_stream_grant.read["SELECT"]: Refreshing state... [id=FIVETRAN|PUBLIC||SELECT|false|true|false|FIVETRAN_READER,FIVETRAN_ADMIN]
module.fivetran_db.snowflake_stage_grant.read["USAGE"]: Refreshing state... [id=FIVETRAN|PUBLIC||USAGE|false|true|false|FIVETRAN_READER,FIVETRAN_ADMIN]
module.fivetran_db.snowflake_pipe_grant.read["MONITOR"]: Refreshing state... [id=FIVETRAN|PUBLIC||MONITOR|false|true|FIVETRAN_READER,FIVETRAN_ADMIN]
module.fivetran_db.snowflake_view_grant.read["REFERENCES"]: Refreshing state... [id=FIVETRAN|||REFERENCES|false|true|false|FIVETRAN_READER,FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_view_grant.read["SELECT"]: Refreshing state... [id=FIVETRAN|||SELECT|false|true|false|FIVETRAN_READER,FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_table_grant.read["SELECT"]: Refreshing state... [id=FIVETRAN|||SELECT|false|true|false|FIVETRAN_READER,FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_table_grant.read["REFERENCES"]: Refreshing state... [id=FIVETRAN|||REFERENCES|false|true|false|FIVETRAN_READER,FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_file_format_grant.read["USAGE"]: Refreshing state... [id=FIVETRAN|PUBLIC||USAGE|false|true|false|FIVETRAN_READER,FIVETRAN_ADMIN]
module.fivetran_db.snowflake_schema_grant.public_read["USAGE"]: Refreshing state... [id=FIVETRAN|PUBLIC|USAGE|false|false|false|FIVETRAN_READER,FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_schema_grant.read["USAGE"]: Refreshing state... [id=FIVETRAN||USAGE|false|true|false|FIVETRAN_READER,FIVETRAN_ADMIN|]
module.fivetran_db.snowflake_external_table_grant.read["SELECT"]: Refreshing state... [id=FIVETRAN|PUBLIC||SELECT|false|true|false|FIVETRAN_READER,FIVETRAN_ADMIN|]
module.analytics_db["STAGING"].snowflake_role_grants.reader[0]: Refreshing state... [id=ANALYTICS_STAGING_READER|ANALYST,READER|]
module.analytics_db["PROD"].snowflake_role_grants.reader[0]: Refreshing state... [id=ANALYTICS_PROD_READER|ANALYST,READER|]
module.meltano_db.snowflake_warehouse_grant.app_role[0]: Refreshing state... [id=MELTANO_WH|USAGE|false|MELTANO_ADMIN]
module.meltano_db.snowflake_user.app[0]: Refreshing state... [id=MELTANO_USER]
module.meltano_db.snowflake_role_grants.reader[0]: Refreshing state... [id=MELTANO_READER|READER|]
module.developer_dbs["richard"].snowflake_database.app: Refreshing state... [id=DEV_RICHARD]
module.developer_dbs["gilfoyle"].snowflake_database.app: Refreshing state... [id=DEV_GILFOYLE]
module.analytics_db["PROD"].snowflake_stage_grant.read["USAGE"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC||USAGE|false|true|false|ANALYTICS_PROD_ADMIN,ANALYTICS_PROD_READER]
module.analytics_db["STAGING"].snowflake_stage_grant.read["USAGE"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC||USAGE|false|true|false|ANALYTICS_STAGING_READER,ANALYTICS_STAGING_ADMIN]
module.analytics_db["PROD"].snowflake_schema_grant.read["USAGE"]: Refreshing state... [id=ANALYTICS_PROD||USAGE|false|true|false|ANALYTICS_PROD_ADMIN,ANALYTICS_PROD_READER|]
module.analytics_db["STAGING"].snowflake_schema_grant.read["USAGE"]: Refreshing state... [id=ANALYTICS_STAGING||USAGE|false|true|false|ANALYTICS_STAGING_READER,ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_sequence_grant.read["USAGE"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC||USAGE|false|true|false|ANALYTICS_STAGING_READER,ANALYTICS_STAGING_ADMIN]
module.analytics_db["PROD"].snowflake_sequence_grant.read["USAGE"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC||USAGE|false|true|false|ANALYTICS_PROD_ADMIN,ANALYTICS_PROD_READER]
module.analytics_db["STAGING"].snowflake_file_format_grant.read["USAGE"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC||USAGE|false|true|false|ANALYTICS_STAGING_READER,ANALYTICS_STAGING_ADMIN]
module.analytics_db["PROD"].snowflake_file_format_grant.read["USAGE"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC||USAGE|false|true|false|ANALYTICS_PROD_ADMIN,ANALYTICS_PROD_READER]
module.analytics_db["PROD"].snowflake_schema_grant.public_read["USAGE"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|USAGE|false|false|false|ANALYTICS_PROD_ADMIN,ANALYTICS_PROD_READER|]
module.analytics_db["STAGING"].snowflake_schema_grant.public_read["USAGE"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|USAGE|false|false|false|ANALYTICS_STAGING_READER,ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.public_admin["CREATE PROCEDURE"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|CREATE PROCEDURE|false|false|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.public_admin["CREATE EXTERNAL TABLE"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|CREATE EXTERNAL TABLE|false|false|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.public_admin["CREATE STAGE"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|CREATE STAGE|false|false|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.public_admin["CREATE TASK"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|CREATE TASK|false|false|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.public_admin["CREATE FILE FORMAT"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|CREATE FILE FORMAT|false|false|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.public_admin["CREATE STREAM"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|CREATE STREAM|false|false|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.public_admin["CREATE SEQUENCE"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|CREATE SEQUENCE|false|false|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.public_admin["CREATE FILE FORMAT"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|CREATE FILE FORMAT|false|false|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.public_admin["CREATE STAGE"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|CREATE STAGE|false|false|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.public_admin["CREATE STREAM"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|CREATE STREAM|false|false|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.public_admin["MODIFY"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|MODIFY|false|false|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.public_admin["CREATE TABLE"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|CREATE TABLE|false|false|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.public_admin["CREATE VIEW"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|CREATE VIEW|false|false|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.public_admin["CREATE EXTERNAL TABLE"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|CREATE EXTERNAL TABLE|false|false|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.public_admin["CREATE PIPE"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|CREATE PIPE|false|false|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.public_admin["CREATE TABLE"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|CREATE TABLE|false|false|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.public_admin["CREATE MASKING POLICY"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|CREATE MASKING POLICY|false|false|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.public_admin["CREATE PIPE"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|CREATE PIPE|false|false|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.public_admin["CREATE FUNCTION"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|CREATE FUNCTION|false|false|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.public_admin["MONITOR"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|MONITOR|false|false|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.public_admin["CREATE TASK"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|CREATE TASK|false|false|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.public_admin["MONITOR"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|MONITOR|false|false|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.public_admin["CREATE MASKING POLICY"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|CREATE MASKING POLICY|false|false|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.public_admin["MODIFY"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|MODIFY|false|false|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.public_admin["CREATE FUNCTION"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|CREATE FUNCTION|false|false|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.public_admin["CREATE VIEW"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|CREATE VIEW|false|false|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.public_admin["CREATE SEQUENCE"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|CREATE SEQUENCE|false|false|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.public_admin["CREATE PROCEDURE"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|CREATE PROCEDURE|false|false|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["STAGING"].snowflake_pipe_grant.read["MONITOR"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC||MONITOR|false|true|ANALYTICS_STAGING_READER,ANALYTICS_STAGING_ADMIN]
module.analytics_db["PROD"].snowflake_pipe_grant.read["MONITOR"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC||MONITOR|false|true|ANALYTICS_PROD_ADMIN,ANALYTICS_PROD_READER]
module.analytics_db["PROD"].snowflake_view_grant.read["SELECT"]: Refreshing state... [id=ANALYTICS_PROD|||SELECT|false|true|false|ANALYTICS_PROD_ADMIN,ANALYTICS_PROD_READER|]
module.analytics_db["STAGING"].snowflake_database_grant.admin["CREATE SCHEMA"]: Refreshing state... [id=ANALYTICS_STAGING|CREATE SCHEMA|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_pipe_grant.admin["OPERATE"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC||OPERATE|false|true|ANALYTICS_STAGING_ADMIN]
module.analytics_db["STAGING"].snowflake_procedure_grant.read["USAGE"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC|||USAGE|false|true|false|ANALYTICS_STAGING_READER,ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_database_grant.admin["CREATE SCHEMA"]: Refreshing state... [id=ANALYTICS_PROD|CREATE SCHEMA|false|ANALYTICS_PROD_ADMIN|]
module.stitch_db.snowflake_role_grants.admin: Refreshing state... [id=STITCH_ADMIN|SYSADMIN|STITCH_USER]
module.analytics_db["PROD"].snowflake_pipe_grant.admin["OPERATE"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC||OPERATE|false|true|ANALYTICS_PROD_ADMIN]
module.analytics_db["STAGING"].snowflake_stream_grant.read["SELECT"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC||SELECT|false|true|false|ANALYTICS_STAGING_READER,ANALYTICS_STAGING_ADMIN]
module.analytics_db["PROD"].snowflake_external_table_grant.read["SELECT"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC||SELECT|false|true|false|ANALYTICS_PROD_ADMIN,ANALYTICS_PROD_READER|]
module.analytics_db["PROD"].snowflake_stream_grant.read["SELECT"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC||SELECT|false|true|false|ANALYTICS_PROD_ADMIN,ANALYTICS_PROD_READER]
module.analytics_db["STAGING"].snowflake_view_grant.read["REFERENCES"]: Refreshing state... [id=ANALYTICS_STAGING|||REFERENCES|false|true|false|ANALYTICS_STAGING_READER,ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_view_grant.read["SELECT"]: Refreshing state... [id=ANALYTICS_STAGING|||SELECT|false|true|false|ANALYTICS_STAGING_READER,ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_table_grant.read["SELECT"]: Refreshing state... [id=ANALYTICS_STAGING|||SELECT|false|true|false|ANALYTICS_STAGING_READER,ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_view_grant.read["REFERENCES"]: Refreshing state... [id=ANALYTICS_PROD|||REFERENCES|false|true|false|ANALYTICS_PROD_ADMIN,ANALYTICS_PROD_READER|]
module.analytics_db["PROD"].snowflake_schema_grant.admin["CREATE VIEW"]: Refreshing state... [id=ANALYTICS_PROD||CREATE VIEW|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.admin["CREATE PIPE"]: Refreshing state... [id=ANALYTICS_STAGING||CREATE PIPE|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_external_table_grant.read["SELECT"]: Refreshing state... [id=ANALYTICS_STAGING|PUBLIC||SELECT|false|true|false|ANALYTICS_STAGING_READER,ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_procedure_grant.read["USAGE"]: Refreshing state... [id=ANALYTICS_PROD|PUBLIC|||USAGE|false|true|false|ANALYTICS_PROD_ADMIN,ANALYTICS_PROD_READER|]
module.analytics_db["STAGING"].snowflake_schema_grant.admin["CREATE FUNCTION"]: Refreshing state... [id=ANALYTICS_STAGING||CREATE FUNCTION|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_database_grant.read["USAGE"]: Refreshing state... [id=ANALYTICS_STAGING|USAGE|false|ANALYTICS_STAGING_READER,ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.admin["CREATE EXTERNAL TABLE"]: Refreshing state... [id=ANALYTICS_PROD||CREATE EXTERNAL TABLE|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_database_grant.read["USAGE"]: Refreshing state... [id=ANALYTICS_PROD|USAGE|false|ANALYTICS_PROD_ADMIN,ANALYTICS_PROD_READER|]
module.analytics_db["STAGING"].snowflake_schema_grant.admin["CREATE TASK"]: Refreshing state... [id=ANALYTICS_STAGING||CREATE TASK|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.fivetran_db.snowflake_role_grants.admin: Refreshing state... [id=FIVETRAN_ADMIN|SYSADMIN|FIVETRAN_USER]
module.analytics_db["PROD"].snowflake_schema_grant.admin["CREATE STREAM"]: Refreshing state... [id=ANALYTICS_PROD||CREATE STREAM|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.admin["CREATE FILE FORMAT"]: Refreshing state... [id=ANALYTICS_PROD||CREATE FILE FORMAT|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.admin["CREATE FILE FORMAT"]: Refreshing state... [id=ANALYTICS_STAGING||CREATE FILE FORMAT|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.admin["CREATE FUNCTION"]: Refreshing state... [id=ANALYTICS_PROD||CREATE FUNCTION|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_table_grant.read["REFERENCES"]: Refreshing state... [id=ANALYTICS_PROD|||REFERENCES|false|true|false|ANALYTICS_PROD_ADMIN,ANALYTICS_PROD_READER|]
module.analytics_db["STAGING"].snowflake_schema_grant.admin["CREATE VIEW"]: Refreshing state... [id=ANALYTICS_STAGING||CREATE VIEW|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_table_grant.read["SELECT"]: Refreshing state... [id=ANALYTICS_PROD|||SELECT|false|true|false|ANALYTICS_PROD_ADMIN,ANALYTICS_PROD_READER|]
module.analytics_db["STAGING"].snowflake_schema_grant.admin["CREATE EXTERNAL TABLE"]: Refreshing state... [id=ANALYTICS_STAGING||CREATE EXTERNAL TABLE|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_table_grant.read["REFERENCES"]: Refreshing state... [id=ANALYTICS_STAGING|||REFERENCES|false|true|false|ANALYTICS_STAGING_READER,ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.admin["MONITOR"]: Refreshing state... [id=ANALYTICS_PROD||MONITOR|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.admin["CREATE SEQUENCE"]: Refreshing state... [id=ANALYTICS_STAGING||CREATE SEQUENCE|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.admin["CREATE TASK"]: Refreshing state... [id=ANALYTICS_PROD||CREATE TASK|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.admin["MODIFY"]: Refreshing state... [id=ANALYTICS_PROD||MODIFY|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.admin["CREATE MASKING POLICY"]: Refreshing state... [id=ANALYTICS_PROD||CREATE MASKING POLICY|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.admin["CREATE SEQUENCE"]: Refreshing state... [id=ANALYTICS_PROD||CREATE SEQUENCE|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.admin["CREATE TABLE"]: Refreshing state... [id=ANALYTICS_PROD||CREATE TABLE|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.admin["CREATE PIPE"]: Refreshing state... [id=ANALYTICS_PROD||CREATE PIPE|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.admin["MODIFY"]: Refreshing state... [id=ANALYTICS_STAGING||MODIFY|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.admin["CREATE PROCEDURE"]: Refreshing state... [id=ANALYTICS_STAGING||CREATE PROCEDURE|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.admin["CREATE PROCEDURE"]: Refreshing state... [id=ANALYTICS_PROD||CREATE PROCEDURE|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.admin["CREATE TABLE"]: Refreshing state... [id=ANALYTICS_STAGING||CREATE TABLE|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.admin["CREATE STREAM"]: Refreshing state... [id=ANALYTICS_STAGING||CREATE STREAM|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_schema_grant.admin["CREATE STAGE"]: Refreshing state... [id=ANALYTICS_PROD||CREATE STAGE|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.admin["CREATE MASKING POLICY"]: Refreshing state... [id=ANALYTICS_STAGING||CREATE MASKING POLICY|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.admin["MONITOR"]: Refreshing state... [id=ANALYTICS_STAGING||MONITOR|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_table_grant.admin["UPDATE"]: Refreshing state... [id=ANALYTICS_PROD|||UPDATE|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_table_grant.admin["TRUNCATE"]: Refreshing state... [id=ANALYTICS_PROD|||TRUNCATE|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["PROD"].snowflake_table_grant.admin["DELETE"]: Refreshing state... [id=ANALYTICS_PROD|||DELETE|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["STAGING"].snowflake_table_grant.admin["DELETE"]: Refreshing state... [id=ANALYTICS_STAGING|||DELETE|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_schema_grant.admin["CREATE STAGE"]: Refreshing state... [id=ANALYTICS_STAGING||CREATE STAGE|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_table_grant.admin["TRUNCATE"]: Refreshing state... [id=ANALYTICS_STAGING|||TRUNCATE|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["PROD"].snowflake_table_grant.admin["INSERT"]: Refreshing state... [id=ANALYTICS_PROD|||INSERT|false|true|false|ANALYTICS_PROD_ADMIN|]
module.analytics_db["STAGING"].snowflake_table_grant.admin["INSERT"]: Refreshing state... [id=ANALYTICS_STAGING|||INSERT|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.analytics_db["STAGING"].snowflake_table_grant.admin["UPDATE"]: Refreshing state... [id=ANALYTICS_STAGING|||UPDATE|false|true|false|ANALYTICS_STAGING_ADMIN|]
module.meltano_db.snowflake_pipe_grant.admin["OPERATE"]: Refreshing state... [id=MELTANO|PUBLIC||OPERATE|false|true|MELTANO_ADMIN]
module.meltano_db.snowflake_schema_grant.admin["CREATE FILE FORMAT"]: Refreshing state... [id=MELTANO||CREATE FILE FORMAT|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.admin["CREATE TABLE"]: Refreshing state... [id=MELTANO||CREATE TABLE|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.admin["CREATE STREAM"]: Refreshing state... [id=MELTANO||CREATE STREAM|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.admin["MODIFY"]: Refreshing state... [id=MELTANO||MODIFY|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.admin["CREATE MASKING POLICY"]: Refreshing state... [id=MELTANO||CREATE MASKING POLICY|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.admin["CREATE STAGE"]: Refreshing state... [id=MELTANO||CREATE STAGE|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.admin["CREATE SEQUENCE"]: Refreshing state... [id=MELTANO||CREATE SEQUENCE|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.admin["CREATE TASK"]: Refreshing state... [id=MELTANO||CREATE TASK|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.admin["CREATE EXTERNAL TABLE"]: Refreshing state... [id=MELTANO||CREATE EXTERNAL TABLE|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.admin["CREATE PROCEDURE"]: Refreshing state... [id=MELTANO||CREATE PROCEDURE|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.admin["MONITOR"]: Refreshing state... [id=MELTANO||MONITOR|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.admin["CREATE PIPE"]: Refreshing state... [id=MELTANO||CREATE PIPE|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.admin["CREATE FUNCTION"]: Refreshing state... [id=MELTANO||CREATE FUNCTION|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.admin["CREATE VIEW"]: Refreshing state... [id=MELTANO||CREATE VIEW|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_database_grant.admin["CREATE SCHEMA"]: Refreshing state... [id=MELTANO|CREATE SCHEMA|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_table_grant.admin["UPDATE"]: Refreshing state... [id=MELTANO|||UPDATE|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_table_grant.admin["DELETE"]: Refreshing state... [id=MELTANO|||DELETE|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_table_grant.admin["INSERT"]: Refreshing state... [id=MELTANO|||INSERT|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_table_grant.admin["TRUNCATE"]: Refreshing state... [id=MELTANO|||TRUNCATE|false|true|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.public_admin["CREATE TABLE"]: Refreshing state... [id=MELTANO|PUBLIC|CREATE TABLE|false|false|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.public_admin["CREATE PIPE"]: Refreshing state... [id=MELTANO|PUBLIC|CREATE PIPE|false|false|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.public_admin["CREATE STAGE"]: Refreshing state... [id=MELTANO|PUBLIC|CREATE STAGE|false|false|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.public_admin["MODIFY"]: Refreshing state... [id=MELTANO|PUBLIC|MODIFY|false|false|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.public_admin["MONITOR"]: Refreshing state... [id=MELTANO|PUBLIC|MONITOR|false|false|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.public_admin["CREATE TASK"]: Refreshing state... [id=MELTANO|PUBLIC|CREATE TASK|false|false|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.public_admin["CREATE MASKING POLICY"]: Refreshing state... [id=MELTANO|PUBLIC|CREATE MASKING POLICY|false|false|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.public_admin["CREATE SEQUENCE"]: Refreshing state... [id=MELTANO|PUBLIC|CREATE SEQUENCE|false|false|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.public_admin["CREATE STREAM"]: Refreshing state... [id=MELTANO|PUBLIC|CREATE STREAM|false|false|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.public_admin["CREATE EXTERNAL TABLE"]: Refreshing state... [id=MELTANO|PUBLIC|CREATE EXTERNAL TABLE|false|false|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.public_admin["CREATE VIEW"]: Refreshing state... [id=MELTANO|PUBLIC|CREATE VIEW|false|false|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.public_admin["CREATE FILE FORMAT"]: Refreshing state... [id=MELTANO|PUBLIC|CREATE FILE FORMAT|false|false|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.public_admin["CREATE FUNCTION"]: Refreshing state... [id=MELTANO|PUBLIC|CREATE FUNCTION|false|false|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_schema_grant.public_admin["CREATE PROCEDURE"]: Refreshing state... [id=MELTANO|PUBLIC|CREATE PROCEDURE|false|false|false|MELTANO_ADMIN|]
module.meltano_db.snowflake_view_grant.read["REFERENCES"]: Refreshing state... [id=MELTANO|||REFERENCES|false|true|false|MELTANO_ADMIN,MELTANO_READER|]
module.meltano_db.snowflake_view_grant.read["SELECT"]: Refreshing state... [id=MELTANO|||SELECT|false|true|false|MELTANO_ADMIN,MELTANO_READER|]
module.meltano_db.snowflake_schema_grant.read["USAGE"]: Refreshing state... [id=MELTANO||USAGE|false|true|false|MELTANO_ADMIN,MELTANO_READER|]
module.meltano_db.snowflake_procedure_grant.read["USAGE"]: Refreshing state... [id=MELTANO|PUBLIC|||USAGE|false|true|false|MELTANO_ADMIN,MELTANO_READER|]
module.meltano_db.snowflake_stage_grant.read["USAGE"]: Refreshing state... [id=MELTANO|PUBLIC||USAGE|false|true|false|MELTANO_ADMIN,MELTANO_READER]
module.meltano_db.snowflake_external_table_grant.read["SELECT"]: Refreshing state... [id=MELTANO|PUBLIC||SELECT|false|true|false|MELTANO_ADMIN,MELTANO_READER|]
module.meltano_db.snowflake_database_grant.read["USAGE"]: Refreshing state... [id=MELTANO|USAGE|false|MELTANO_ADMIN,MELTANO_READER|]
module.meltano_db.snowflake_pipe_grant.read["MONITOR"]: Refreshing state... [id=MELTANO|PUBLIC||MONITOR|false|true|MELTANO_ADMIN,MELTANO_READER]
module.meltano_db.snowflake_file_format_grant.read["USAGE"]: Refreshing state... [id=MELTANO|PUBLIC||USAGE|false|true|false|MELTANO_ADMIN,MELTANO_READER]
module.meltano_db.snowflake_table_grant.read["REFERENCES"]: Refreshing state... [id=MELTANO|||REFERENCES|false|true|false|MELTANO_ADMIN,MELTANO_READER|]
module.meltano_db.snowflake_table_grant.read["SELECT"]: Refreshing state... [id=MELTANO|||SELECT|false|true|false|MELTANO_ADMIN,MELTANO_READER|]
module.meltano_db.snowflake_stream_grant.read["SELECT"]: Refreshing state... [id=MELTANO|PUBLIC||SELECT|false|true|false|MELTANO_ADMIN,MELTANO_READER]
module.meltano_db.snowflake_schema_grant.public_read["USAGE"]: Refreshing state... [id=MELTANO|PUBLIC|USAGE|false|false|false|MELTANO_ADMIN,MELTANO_READER|]
module.meltano_db.snowflake_sequence_grant.read["USAGE"]: Refreshing state... [id=MELTANO|PUBLIC||USAGE|false|true|false|MELTANO_ADMIN,MELTANO_READER]
module.analytics_db["STAGING"].snowflake_role_grants.admin: Refreshing state... [id=ANALYTICS_STAGING_ADMIN|SYSADMIN|DBT_CLOUD_USER]
module.analytics_db["PROD"].snowflake_role_grants.admin: Refreshing state... [id=ANALYTICS_PROD_ADMIN|SYSADMIN|DBT_CLOUD_USER]
module.meltano_db.snowflake_role_grants.admin: Refreshing state... [id=MELTANO_ADMIN|SYSADMIN|MELTANO_USER]
module.developer_dbs["richard"].snowflake_role.reader: Refreshing state... [id=DEV_RICHARD_READER]
module.developer_dbs["gilfoyle"].snowflake_role.reader: Refreshing state... [id=DEV_GILFOYLE_READER]
module.developer_dbs["gilfoyle"].snowflake_role.admin: Refreshing state... [id=DEV_GILFOYLE_ADMIN]
module.developer_dbs["richard"].snowflake_role.admin: Refreshing state... [id=DEV_RICHARD_ADMIN]
module.developer_dbs["gilfoyle"].snowflake_stage_grant.read["USAGE"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC||USAGE|false|true|false|DEV_GILFOYLE_READER,DEV_GILFOYLE_ADMIN]
module.developer_dbs["richard"].snowflake_stage_grant.read["USAGE"]: Refreshing state... [id=DEV_RICHARD|PUBLIC||USAGE|false|true|false|DEV_RICHARD_ADMIN,DEV_RICHARD_READER]
module.developer_dbs["gilfoyle"].snowflake_database_grant.read["USAGE"]: Refreshing state... [id=DEV_GILFOYLE|USAGE|false|DEV_GILFOYLE_READER,DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_file_format_grant.read["USAGE"]: Refreshing state... [id=DEV_RICHARD|PUBLIC||USAGE|false|true|false|DEV_RICHARD_ADMIN,DEV_RICHARD_READER]
module.developer_dbs["richard"].snowflake_database_grant.read["USAGE"]: Refreshing state... [id=DEV_RICHARD|USAGE|false|DEV_RICHARD_ADMIN,DEV_RICHARD_READER|]
module.developer_dbs["gilfoyle"].snowflake_file_format_grant.read["USAGE"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC||USAGE|false|true|false|DEV_GILFOYLE_READER,DEV_GILFOYLE_ADMIN]
module.developer_dbs["richard"].snowflake_pipe_grant.read["MONITOR"]: Refreshing state... [id=DEV_RICHARD|PUBLIC||MONITOR|false|true|DEV_RICHARD_ADMIN,DEV_RICHARD_READER]
module.developer_dbs["gilfoyle"].snowflake_pipe_grant.read["MONITOR"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC||MONITOR|false|true|DEV_GILFOYLE_READER,DEV_GILFOYLE_ADMIN]
module.developer_dbs["richard"].snowflake_table_grant.read["REFERENCES"]: Refreshing state... [id=DEV_RICHARD|||REFERENCES|false|true|false|DEV_RICHARD_ADMIN,DEV_RICHARD_READER|]
module.developer_dbs["richard"].snowflake_table_grant.read["SELECT"]: Refreshing state... [id=DEV_RICHARD|||SELECT|false|true|false|DEV_RICHARD_ADMIN,DEV_RICHARD_READER|]
module.developer_dbs["gilfoyle"].snowflake_table_grant.read["SELECT"]: Refreshing state... [id=DEV_GILFOYLE|||SELECT|false|true|false|DEV_GILFOYLE_READER,DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_table_grant.read["REFERENCES"]: Refreshing state... [id=DEV_GILFOYLE|||REFERENCES|false|true|false|DEV_GILFOYLE_READER,DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_external_table_grant.read["SELECT"]: Refreshing state... [id=DEV_RICHARD|PUBLIC||SELECT|false|true|false|DEV_RICHARD_ADMIN,DEV_RICHARD_READER|]
module.developer_dbs["gilfoyle"].snowflake_external_table_grant.read["SELECT"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC||SELECT|false|true|false|DEV_GILFOYLE_READER,DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_view_grant.read["REFERENCES"]: Refreshing state... [id=DEV_RICHARD|||REFERENCES|false|true|false|DEV_RICHARD_ADMIN,DEV_RICHARD_READER|]
module.developer_dbs["richard"].snowflake_sequence_grant.read["USAGE"]: Refreshing state... [id=DEV_RICHARD|PUBLIC||USAGE|false|true|false|DEV_RICHARD_ADMIN,DEV_RICHARD_READER]
module.developer_dbs["gilfoyle"].snowflake_sequence_grant.read["USAGE"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC||USAGE|false|true|false|DEV_GILFOYLE_READER,DEV_GILFOYLE_ADMIN]
module.developer_dbs["gilfoyle"].snowflake_procedure_grant.read["USAGE"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|||USAGE|false|true|false|DEV_GILFOYLE_READER,DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_view_grant.read["SELECT"]: Refreshing state... [id=DEV_RICHARD|||SELECT|false|true|false|DEV_RICHARD_ADMIN,DEV_RICHARD_READER|]
module.developer_dbs["gilfoyle"].snowflake_view_grant.read["REFERENCES"]: Refreshing state... [id=DEV_GILFOYLE|||REFERENCES|false|true|false|DEV_GILFOYLE_READER,DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_view_grant.read["SELECT"]: Refreshing state... [id=DEV_GILFOYLE|||SELECT|false|true|false|DEV_GILFOYLE_READER,DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_procedure_grant.read["USAGE"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|||USAGE|false|true|false|DEV_RICHARD_ADMIN,DEV_RICHARD_READER|]
module.developer_dbs["richard"].snowflake_stream_grant.read["SELECT"]: Refreshing state... [id=DEV_RICHARD|PUBLIC||SELECT|false|true|false|DEV_RICHARD_ADMIN,DEV_RICHARD_READER]
module.developer_dbs["gilfoyle"].snowflake_stream_grant.read["SELECT"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC||SELECT|false|true|false|DEV_GILFOYLE_READER,DEV_GILFOYLE_ADMIN]
module.developer_dbs["richard"].snowflake_pipe_grant.admin["OPERATE"]: Refreshing state... [id=DEV_RICHARD|PUBLIC||OPERATE|false|true|DEV_RICHARD_ADMIN]
module.developer_dbs["gilfoyle"].snowflake_pipe_grant.admin["OPERATE"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC||OPERATE|false|true|DEV_GILFOYLE_ADMIN]
module.developer_dbs["richard"].snowflake_table_grant.admin["DELETE"]: Refreshing state... [id=DEV_RICHARD|||DELETE|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_table_grant.admin["INSERT"]: Refreshing state... [id=DEV_RICHARD|||INSERT|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_table_grant.admin["TRUNCATE"]: Refreshing state... [id=DEV_RICHARD|||TRUNCATE|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_table_grant.admin["UPDATE"]: Refreshing state... [id=DEV_GILFOYLE|||UPDATE|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_table_grant.admin["UPDATE"]: Refreshing state... [id=DEV_RICHARD|||UPDATE|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_table_grant.admin["TRUNCATE"]: Refreshing state... [id=DEV_GILFOYLE|||TRUNCATE|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_table_grant.admin["DELETE"]: Refreshing state... [id=DEV_GILFOYLE|||DELETE|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_table_grant.admin["INSERT"]: Refreshing state... [id=DEV_GILFOYLE|||INSERT|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.public_read["USAGE"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|USAGE|false|false|false|DEV_RICHARD_ADMIN,DEV_RICHARD_READER|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.public_read["USAGE"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|USAGE|false|false|false|DEV_GILFOYLE_READER,DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_database_grant.admin["CREATE SCHEMA"]: Refreshing state... [id=DEV_GILFOYLE|CREATE SCHEMA|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_database_grant.admin["CREATE SCHEMA"]: Refreshing state... [id=DEV_RICHARD|CREATE SCHEMA|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.admin["CREATE PROCEDURE"]: Refreshing state... [id=DEV_GILFOYLE||CREATE PROCEDURE|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.admin["CREATE EXTERNAL TABLE"]: Refreshing state... [id=DEV_RICHARD||CREATE EXTERNAL TABLE|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.admin["CREATE FILE FORMAT"]: Refreshing state... [id=DEV_GILFOYLE||CREATE FILE FORMAT|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.admin["CREATE MASKING POLICY"]: Refreshing state... [id=DEV_GILFOYLE||CREATE MASKING POLICY|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.admin["CREATE FILE FORMAT"]: Refreshing state... [id=DEV_RICHARD||CREATE FILE FORMAT|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.admin["CREATE TABLE"]: Refreshing state... [id=DEV_RICHARD||CREATE TABLE|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.admin["MONITOR"]: Refreshing state... [id=DEV_RICHARD||MONITOR|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.admin["CREATE SEQUENCE"]: Refreshing state... [id=DEV_GILFOYLE||CREATE SEQUENCE|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.admin["CREATE STAGE"]: Refreshing state... [id=DEV_GILFOYLE||CREATE STAGE|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.admin["CREATE TABLE"]: Refreshing state... [id=DEV_GILFOYLE||CREATE TABLE|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.admin["MONITOR"]: Refreshing state... [id=DEV_GILFOYLE||MONITOR|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.admin["CREATE VIEW"]: Refreshing state... [id=DEV_GILFOYLE||CREATE VIEW|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.admin["CREATE STAGE"]: Refreshing state... [id=DEV_RICHARD||CREATE STAGE|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.admin["CREATE TASK"]: Refreshing state... [id=DEV_RICHARD||CREATE TASK|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.admin["CREATE FUNCTION"]: Refreshing state... [id=DEV_RICHARD||CREATE FUNCTION|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.admin["CREATE PIPE"]: Refreshing state... [id=DEV_GILFOYLE||CREATE PIPE|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.admin["CREATE STREAM"]: Refreshing state... [id=DEV_RICHARD||CREATE STREAM|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.admin["CREATE MASKING POLICY"]: Refreshing state... [id=DEV_RICHARD||CREATE MASKING POLICY|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.admin["MODIFY"]: Refreshing state... [id=DEV_RICHARD||MODIFY|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.admin["CREATE FUNCTION"]: Refreshing state... [id=DEV_GILFOYLE||CREATE FUNCTION|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.admin["CREATE VIEW"]: Refreshing state... [id=DEV_RICHARD||CREATE VIEW|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.admin["CREATE TASK"]: Refreshing state... [id=DEV_GILFOYLE||CREATE TASK|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.admin["CREATE PIPE"]: Refreshing state... [id=DEV_RICHARD||CREATE PIPE|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.admin["CREATE STREAM"]: Refreshing state... [id=DEV_GILFOYLE||CREATE STREAM|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.admin["MODIFY"]: Refreshing state... [id=DEV_GILFOYLE||MODIFY|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.admin["CREATE PROCEDURE"]: Refreshing state... [id=DEV_RICHARD||CREATE PROCEDURE|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.read["USAGE"]: Refreshing state... [id=DEV_RICHARD||USAGE|false|true|false|DEV_RICHARD_ADMIN,DEV_RICHARD_READER|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.admin["CREATE EXTERNAL TABLE"]: Refreshing state... [id=DEV_GILFOYLE||CREATE EXTERNAL TABLE|false|true|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.read["USAGE"]: Refreshing state... [id=DEV_GILFOYLE||USAGE|false|true|false|DEV_GILFOYLE_READER,DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.admin["CREATE SEQUENCE"]: Refreshing state... [id=DEV_RICHARD||CREATE SEQUENCE|false|true|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.public_admin["CREATE EXTERNAL TABLE"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|CREATE EXTERNAL TABLE|false|false|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.public_admin["CREATE PROCEDURE"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|CREATE PROCEDURE|false|false|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.public_admin["CREATE VIEW"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|CREATE VIEW|false|false|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.public_admin["CREATE MASKING POLICY"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|CREATE MASKING POLICY|false|false|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.public_admin["MODIFY"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|MODIFY|false|false|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.public_admin["CREATE SEQUENCE"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|CREATE SEQUENCE|false|false|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.public_admin["CREATE STREAM"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|CREATE STREAM|false|false|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.public_admin["CREATE PIPE"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|CREATE PIPE|false|false|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.public_admin["CREATE FUNCTION"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|CREATE FUNCTION|false|false|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.public_admin["CREATE EXTERNAL TABLE"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|CREATE EXTERNAL TABLE|false|false|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.public_admin["CREATE TASK"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|CREATE TASK|false|false|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.public_admin["CREATE TASK"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|CREATE TASK|false|false|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.public_admin["CREATE STAGE"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|CREATE STAGE|false|false|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.public_admin["CREATE STREAM"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|CREATE STREAM|false|false|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.public_admin["MONITOR"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|MONITOR|false|false|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.public_admin["CREATE PROCEDURE"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|CREATE PROCEDURE|false|false|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.public_admin["CREATE FILE FORMAT"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|CREATE FILE FORMAT|false|false|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.public_admin["MONITOR"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|MONITOR|false|false|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.public_admin["CREATE FILE FORMAT"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|CREATE FILE FORMAT|false|false|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.public_admin["CREATE SEQUENCE"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|CREATE SEQUENCE|false|false|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.public_admin["CREATE VIEW"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|CREATE VIEW|false|false|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.public_admin["CREATE TABLE"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|CREATE TABLE|false|false|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.public_admin["CREATE PIPE"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|CREATE PIPE|false|false|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.public_admin["CREATE MASKING POLICY"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|CREATE MASKING POLICY|false|false|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.public_admin["CREATE STAGE"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|CREATE STAGE|false|false|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["richard"].snowflake_schema_grant.public_admin["CREATE FUNCTION"]: Refreshing state... [id=DEV_RICHARD|PUBLIC|CREATE FUNCTION|false|false|false|DEV_RICHARD_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.public_admin["MODIFY"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|MODIFY|false|false|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_schema_grant.public_admin["CREATE TABLE"]: Refreshing state... [id=DEV_GILFOYLE|PUBLIC|CREATE TABLE|false|false|false|DEV_GILFOYLE_ADMIN|]
module.developer_dbs["gilfoyle"].snowflake_role_grants.admin: Refreshing state... [id=DEV_GILFOYLE_ADMIN||gilfoyle]
module.developer_dbs["richard"].snowflake_role_grants.admin: Refreshing state... [id=DEV_RICHARD_ADMIN||Richard Hendricks]
module.bulk_warehouse_grants.snowflake_warehouse_grant.main["REPORTING_WH"]: Refreshing state... [id=REPORTING_WH|USAGE|false|ANALYST,PUBLIC]
module.bulk_warehouse_grants.snowflake_warehouse_grant.main["PROCESSING_WH"]: Refreshing state... [id=PROCESSING_WH|USAGE|false|ANALYTICS_PROD_ADMIN,ANALYST,DEV_GILFOYLE_ADMIN,ANALYTICS_STAGING_ADMIN,DEV_RICHARD_ADMIN]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fivetran_db.snowflake_user.app[0] has changed
  ~ resource "snowflake_user" "app" {
      + default_secondary_roles = []
        id                      = "FIVETRAN_USER"
        name                    = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # module.meltano_db.snowflake_user.app[0] has changed
  ~ resource "snowflake_user" "app" {
      + default_secondary_roles = []
        id                      = "MELTANO_USER"
        name                    = (sensitive value)
        # (13 unchanged attributes hidden)
    }

  # module.stitch_db.snowflake_user.app[0] has changed
  ~ resource "snowflake_user" "app" {
      + default_secondary_roles = []
        id                      = "STITCH_USER"
        name                    = (sensitive value)
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.bulk_warehouse_grants.snowflake_warehouse_grant.main["PROCESSING_WH"] will be updated in-place
  ~ resource "snowflake_warehouse_grant" "main" {
        id                     = "PROCESSING_WH|USAGE|false|ANALYTICS_PROD_ADMIN,ANALYST,DEV_GILFOYLE_ADMIN,ANALYTICS_STAGING_ADMIN,DEV_RICHARD_ADMIN"
      ~ roles                  = [
          + "DEV_HALEY_ADMIN",
            # (5 unchanged elements hidden)
        ]
        # (4 unchanged attributes hidden)
    }

  # module.developer_dbs["haley"].snowflake_database.app will be created
  + resource "snowflake_database" "app" {
      + comment                     = "Application resources managed by Terraform."
      + data_retention_time_in_days = -1
      + id                          = (known after apply)
      + is_transient                = false
      + name                        = "DEV_HALEY"
    }

  # module.developer_dbs["haley"].snowflake_database_grant.admin["CREATE SCHEMA"] will be created
  + resource "snowflake_database_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + privilege              = "CREATE SCHEMA"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_database_grant.read["USAGE"] will be created
  + resource "snowflake_database_grant" "read" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + privilege              = "USAGE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
          + "DEV_HALEY_READER",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_external_table_grant.read["SELECT"] will be created
  + resource "snowflake_external_table_grant" "read" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "SELECT"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
          + "DEV_HALEY_READER",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_file_format_grant.read["USAGE"] will be created
  + resource "snowflake_file_format_grant" "read" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "USAGE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
          + "DEV_HALEY_READER",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_pipe_grant.admin["OPERATE"] will be created
  + resource "snowflake_pipe_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_future              = true
      + privilege              = "OPERATE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_pipe_grant.read["MONITOR"] will be created
  + resource "snowflake_pipe_grant" "read" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_future              = true
      + privilege              = "MONITOR"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
          + "DEV_HALEY_READER",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_procedure_grant.read["USAGE"] will be created
  + resource "snowflake_procedure_grant" "read" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "USAGE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
          + "DEV_HALEY_READER",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_role.admin will be created
  + resource "snowflake_role" "admin" {
      + comment = "Application resources managed by Terraform."
      + id      = (known after apply)
      + name    = "DEV_HALEY_ADMIN"
    }

  # module.developer_dbs["haley"].snowflake_role.reader will be created
  + resource "snowflake_role" "reader" {
      + comment = "Application resources managed by Terraform."
      + id      = (known after apply)
      + name    = "DEV_HALEY_READER"
    }

  # module.developer_dbs["haley"].snowflake_role_grants.admin will be created
  + resource "snowflake_role_grants" "admin" {
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + role_name              = "DEV_HALEY_ADMIN"
      + users                  = (sensitive value)
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.admin["CREATE EXTERNAL TABLE"] will be created
  + resource "snowflake_schema_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "CREATE EXTERNAL TABLE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.admin["CREATE FILE FORMAT"] will be created
  + resource "snowflake_schema_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "CREATE FILE FORMAT"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.admin["CREATE FUNCTION"] will be created
  + resource "snowflake_schema_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "CREATE FUNCTION"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.admin["CREATE MASKING POLICY"] will be created
  + resource "snowflake_schema_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "CREATE MASKING POLICY"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.admin["CREATE PIPE"] will be created
  + resource "snowflake_schema_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "CREATE PIPE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.admin["CREATE PROCEDURE"] will be created
  + resource "snowflake_schema_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "CREATE PROCEDURE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.admin["CREATE SEQUENCE"] will be created
  + resource "snowflake_schema_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "CREATE SEQUENCE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.admin["CREATE STAGE"] will be created
  + resource "snowflake_schema_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "CREATE STAGE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.admin["CREATE STREAM"] will be created
  + resource "snowflake_schema_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "CREATE STREAM"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.admin["CREATE TABLE"] will be created
  + resource "snowflake_schema_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "CREATE TABLE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.admin["CREATE TASK"] will be created
  + resource "snowflake_schema_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "CREATE TASK"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.admin["CREATE VIEW"] will be created
  + resource "snowflake_schema_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "CREATE VIEW"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.admin["MODIFY"] will be created
  + resource "snowflake_schema_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "MODIFY"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.admin["MONITOR"] will be created
  + resource "snowflake_schema_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "MONITOR"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.public_admin["CREATE EXTERNAL TABLE"] will be created
  + resource "snowflake_schema_grant" "public_admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "CREATE EXTERNAL TABLE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.public_admin["CREATE FILE FORMAT"] will be created
  + resource "snowflake_schema_grant" "public_admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "CREATE FILE FORMAT"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.public_admin["CREATE FUNCTION"] will be created
  + resource "snowflake_schema_grant" "public_admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "CREATE FUNCTION"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.public_admin["CREATE MASKING POLICY"] will be created
  + resource "snowflake_schema_grant" "public_admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "CREATE MASKING POLICY"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.public_admin["CREATE PIPE"] will be created
  + resource "snowflake_schema_grant" "public_admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "CREATE PIPE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.public_admin["CREATE PROCEDURE"] will be created
  + resource "snowflake_schema_grant" "public_admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "CREATE PROCEDURE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.public_admin["CREATE SEQUENCE"] will be created
  + resource "snowflake_schema_grant" "public_admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "CREATE SEQUENCE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.public_admin["CREATE STAGE"] will be created
  + resource "snowflake_schema_grant" "public_admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "CREATE STAGE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.public_admin["CREATE STREAM"] will be created
  + resource "snowflake_schema_grant" "public_admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "CREATE STREAM"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.public_admin["CREATE TABLE"] will be created
  + resource "snowflake_schema_grant" "public_admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "CREATE TABLE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.public_admin["CREATE TASK"] will be created
  + resource "snowflake_schema_grant" "public_admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "CREATE TASK"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.public_admin["CREATE VIEW"] will be created
  + resource "snowflake_schema_grant" "public_admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "CREATE VIEW"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.public_admin["MODIFY"] will be created
  + resource "snowflake_schema_grant" "public_admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "MODIFY"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.public_admin["MONITOR"] will be created
  + resource "snowflake_schema_grant" "public_admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "MONITOR"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.public_read["USAGE"] will be created
  + resource "snowflake_schema_grant" "public_read" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "USAGE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
          + "DEV_HALEY_READER",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_schema_grant.read["USAGE"] will be created
  + resource "snowflake_schema_grant" "read" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "USAGE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
          + "DEV_HALEY_READER",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_sequence_grant.read["USAGE"] will be created
  + resource "snowflake_sequence_grant" "read" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "USAGE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
          + "DEV_HALEY_READER",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_stage_grant.read["USAGE"] will be created
  + resource "snowflake_stage_grant" "read" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "USAGE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
          + "DEV_HALEY_READER",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_stream_grant.read["SELECT"] will be created
  + resource "snowflake_stream_grant" "read" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "SELECT"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
          + "DEV_HALEY_READER",
        ]
      + schema_name            = "PUBLIC"
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_table_grant.admin["DELETE"] will be created
  + resource "snowflake_table_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "DELETE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_table_grant.admin["INSERT"] will be created
  + resource "snowflake_table_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "INSERT"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_table_grant.admin["TRUNCATE"] will be created
  + resource "snowflake_table_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "TRUNCATE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_table_grant.admin["UPDATE"] will be created
  + resource "snowflake_table_grant" "admin" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "UPDATE"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_table_grant.read["REFERENCES"] will be created
  + resource "snowflake_table_grant" "read" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "REFERENCES"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
          + "DEV_HALEY_READER",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_table_grant.read["SELECT"] will be created
  + resource "snowflake_table_grant" "read" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "SELECT"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
          + "DEV_HALEY_READER",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_view_grant.read["REFERENCES"] will be created
  + resource "snowflake_view_grant" "read" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "REFERENCES"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
          + "DEV_HALEY_READER",
        ]
      + with_grant_option      = false
    }

  # module.developer_dbs["haley"].snowflake_view_grant.read["SELECT"] will be created
  + resource "snowflake_view_grant" "read" {
      + database_name          = "DEV_HALEY"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = true
      + privilege              = "SELECT"
      + roles                  = [
          + "DEV_HALEY_ADMIN",
          + "DEV_HALEY_READER",
        ]
      + with_grant_option      = false
    }

  # module.employees.random_password.users["haley"] will be created
  + resource "random_password" "users" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.employees.snowflake_user.main["haley"] will be created
  + resource "snowflake_user" "main" {
      + comment              = "User managed by Terraform."
      + default_role         = "PUBLIC"
      + disabled             = (known after apply)
      + display_name         = (sensitive value)
      + email                = (sensitive value)
      + has_rsa_public_key   = (known after apply)
      + id                   = (known after apply)
      + login_name           = "haley"
      + must_change_password = true
      + name                 = (sensitive value)
      + password             = (sensitive value)
    }

Plan: 54 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ application_users = (sensitive value)
  ~ system_users      = (sensitive value)

Warning: Value for undeclared variable

The root module does not declare a variable named "account_alias" but a value
was found in file "terraform.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "dynamodb_table_name" but a
value was found in file "terraform.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 2 other variable(s) defined
without being declared.

Warning: Argument is deprecated

  with provider["registry.terraform.io/snowflake-labs/snowflake"],
  on provider.tf line 3, in provider "snowflake":
   3:   region   = var.snowflake_region

Specify the region as part of the account parameter

(and 11 more similar warnings elsewhere)

Warning: Deprecated Resource

  with module.fivetran_db.snowflake_role_grants.admin,
  on modules/application_database/main.tf line 27, in resource "snowflake_role_grants" "admin":
  27: resource "snowflake_role_grants" "admin" {

This resource is deprecated and will be removed in a future major version
release. Please use snowflake_grant_account_role instead.

(and 539 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @sanjidnet, Action: `pull_request`*